# Joining Tables with `dfply`

In [7]:
import pandas as pd
from dfply import *

## Hiding stack traceback

We hide the exception traceback for didactic reasons (code source: [see this post](https://stackoverflow.com/questions/46222753/how-do-i-suppress-tracebacks-in-jupyter)).  Don't run this cell if you want to see a full traceback.

In [2]:
import sys
ipython = get_ipython()

def hide_traceback(exc_tuple=None, filename=None, tb_offset=None,
                   exception_only=False, running_compiled_code=False):
    etype, value, tb = sys.exc_info()
    return ipython._showtraceback(etype, value, ipython.InteractiveTB.get_exception_only(etype, value))

ipython.showtraceback = hide_traceback

## Example

The following tables were taken from the Wikipedia page for joins and will provide a small but sufficiently complicated example for introducing joins.

In [3]:
dept = pd.read_csv("./data/department.csv")
dept

   DeptID     DeptName
0      31        Sales
1      33  Engineering
2      34     Clerical
3      35    Marketing

In [4]:
empl = pd.read_csv("./data/employee.csv")
empl

   DeptID    LastName
0    31.0    Rafferty
1    33.0       Jones
2    33.0  Heisenberg
3    34.0    Robinson
4    34.0       Smith
5     NaN    Williams

In [5]:
dept = pd.read_csv("./data/department.csv")
empl = pd.read_csv("./data/employee.csv")

## Left Outer Join

Use `left_table >> dfply.left_join(right_table, by=common_col_name)`

In [6]:
empl >> left_join(dept, by='DeptID')

   DeptID    LastName     DeptName
0    31.0    Rafferty        Sales
1    33.0       Jones  Engineering
2    33.0  Heisenberg  Engineering
3    34.0    Robinson     Clerical
4    34.0       Smith     Clerical
5     NaN    Williams          NaN

## Rename when the column names are different

In [7]:
empl2 = empl.fillna(0) >> rename(deptIDL = 'DeptID') 
empl2.head(1)

   deptIDL  LastName
0     31.0  Rafferty

In [8]:
empl2 >> left_join(dept, by='DeptID')

KeyError: 'DeptID'

In [9]:
empl2 >> rename(DeptID = 'deptIDL') >> left_join(dept, by='DeptID')

   DeptID    LastName     DeptName
0    31.0    Rafferty        Sales
1    33.0       Jones  Engineering
2    33.0  Heisenberg  Engineering
3    34.0    Robinson     Clerical
4    34.0       Smith     Clerical
5     0.0    Williams          NaN

## Right Outer Join

Use `left_table >> dfply.right_join(right_table, by=common_col_name)`

In [10]:
empl >> right_join(dept, by='DeptID')

   DeptID    LastName     DeptName
0    31.0    Rafferty        Sales
1    33.0       Jones  Engineering
2    33.0  Heisenberg  Engineering
3    34.0    Robinson     Clerical
4    34.0       Smith     Clerical
5    35.0         NaN    Marketing

## Full Outer Join

Use `left_table >> dfply.outer_join(right_table, by=common_col_name)`

In [11]:
empl >> outer_join(dept, by='DeptID')

   DeptID    LastName     DeptName
0    31.0    Rafferty        Sales
1    33.0       Jones  Engineering
2    33.0  Heisenberg  Engineering
3    34.0    Robinson     Clerical
4    34.0       Smith     Clerical
5     NaN    Williams          NaN
6    35.0         NaN    Marketing

## Inner Join

Use `left_table >> dfply.inner_join(right_table, by=common_col_name)`

In [12]:
empl >> inner_join(dept, by='DeptID')

   DeptID    LastName     DeptName
0    31.0    Rafferty        Sales
1    33.0       Jones  Engineering
2    33.0  Heisenberg  Engineering
3    34.0    Robinson     Clerical
4    34.0       Smith     Clerical

## Example 2 - Joining Batting to People

As an example of a joining on more than 1 column, consider the following task.

**Task:** Create a table with the total runs score for each team in 2009.  Include the teams proper name and the name of their home park.

In [13]:
files = ("./data/baseball/core/Batting.csv", 
         "./data/baseball/core/Teams.csv")

In [14]:

batting, teams = [pd.read_csv(f) for f in files]

## Things we need from `Batting.csv`

* Year
* Runs
* Team

In [15]:
batting.head(2)

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,abercda01,1871,1,TRO,NaN,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,0.0
1,addybo01,1871,1,RC1,NaN,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,0.0

#### Selecting down to the necessary columns

In [16]:
batting_select = (batting
                  >> select(X.teamID,
                            X.yearID,
                            X.R)
                 )
batting_select.head()

  teamID  yearID   R
0    TRO    1871   0
1    RC1    1871  30
2    CL1    1871  28
3    WS3    1871  28
4    RC1    1871  29

In [17]:
batting_select.shape

(104324, 3)

## Things we need from `Teams.csv`

* Year
* Team
* Team Name
* Team Park

In [18]:
teams.head(2)

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
0,1871,NaN,BS1,BNA,NaN,3,31,NaN,20,10,...,24,0.834,Boston Red Stockings,South End Grounds I,NaN,103,98,BOS,BS1,BS1
1,1871,NaN,CH1,CNA,NaN,2,28,NaN,19,9,...,16,0.829,Chicago White Stockings,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1

#### Selecting down to the necessary columns

In [19]:
teams_select = (teams >> select(X.yearID,
                                X.teamID,
                                X.name,
                                X.park))
teams_select.head()

   yearID teamID                     name                          park
0    1871    BS1     Boston Red Stockings           South End Grounds I
1    1871    CH1  Chicago White Stockings       Union Base-Ball Grounds
2    1871    CL1   Cleveland Forest Citys  National Association Grounds
3    1871    FW1     Fort Wayne Kekiongas                Hamilton Field
4    1871    NY2         New York Mutuals      Union Grounds (Brooklyn)

## How can we match these columns?

We will need to match on both `teamID` and `yearID` because

1. Team names might change
2. The teams park depends on the year.

## Determining the correct join.

Facts of the task:

* We want batting statistics for all players in 2009
* We want only teams names and parks for teams that played that year.

**Question:** Which join? 
**Answer:** `batting >> left_join(teams)` on both year and

## How to join on multiple columns

Pass a list of columns names to `by`

In [20]:
df_joined = batting_select >> left_join(teams_select, by=['teamID', 'yearID'])
df_joined.head()

,teamID,yearID,R,name,park
0,TRO,1871,0,Troy Haymakers,Haymakers' Grounds
1,RC1,1871,30,Rockford Forest Citys,Agricultural Society Fair Grounds
2,CL1,1871,28,Cleveland Forest Citys,National Association Grounds
3,WS3,1871,28,Washington Olympics,Olympics Grounds
4,RC1,1871,29,Rockford Forest Citys,Agricultural Society Fair Grounds

#### Filter, group by, and aggregate to get the desired result.

In [21]:
runs_per_team09 = (df_joined
                   >> filter_by(X.yearID == 2009)
                   >> group_by(X.name, X.park)
                   >> summarise(total_runs = X.R.sum()))
runs_per_team09.head()

                          park                  name  total_runs
0                  Chase Field  Arizona Diamondbacks         720
1                 Turner Field        Atlanta Braves         735
2  Oriole Park at Camden Yards     Baltimore Orioles         741
3               Fenway Park II        Boston Red Sox         872
4                Wrigley Field          Chicago Cubs         707

In [22]:
runs_per_team09.shape

(30, 3)

## Joins are expensive!

**Be careful when joining large tables!! Especially for full outer joins!!!**

When joining table `A` to table `B`, 

* `inner_join` performs `min(len(A), len(B))` comparisons
* `outer_join` performs `len(A)*len(B)` row comparisons.
* `left_join` and `right_join` are somewhere inbetween (depending on how we treat multiples).

## Outer joins (can) produce LARGE tables.

**Be careful when joining large tables!! Especially for full outer joins!!!**

When joining table `A` to table `B`, 

* `outer_join` might produce `len(A)*len(B)` rows (worst case)
* `left_join` and `right_join` are similar if we don't drop multiples.

#### Last example

In [23]:
teams_select.shape

(2865, 4)

In [24]:
len(batting_select)*len(teams_select)

298888260

## The joining mantra: Filter/aggregate THEN join

By filtering and/or aggregating before joining, you will

* reduce the amount of work
* protect against really large output

#### Filter and aggregate to total runs per team per year

In [25]:
runs = (batting_select
        >> filter_by(X.yearID == 2009)
        >> group_by(X.teamID)
        >> summarise(total_runs = X.R.sum()))

runs.head()

  teamID  total_runs
0    ARI         720
1    ATL         735
2    BAL         741
3    BOS         872
4    CHA         724

#### Filter down to 2009 teams

In [26]:
teams09 = (teams_select
           >> filter_by(X.yearID == 2009)
           >> drop(X.yearID)
          )
teams09.head()

     teamID                  name                         park
2595    ARI  Arizona Diamondbacks                  Chase Field
2596    ATL        Atlanta Braves                 Turner Field
2597    BAL     Baltimore Orioles  Oriole Park at Camden Yards
2598    BOS        Boston Red Sox               Fenway Park II
2599    CHA     Chicago White Sox          U.S. Cellular Field

In [27]:
len(runs),len(teams09)

(30, 30)

In [28]:
len(runs)*len(teams09)

900

## Joining the smaller tables

**Note:** Since we filtered down to 2009, we don't need to join on `yearID`

In [29]:
runs_per_team09_new = (runs 
                       >> left_join(teams09, by='teamID')
                       >> drop(X.teamID))
runs_per_team09_new.head()

   total_runs                  name                         park
0         720  Arizona Diamondbacks                  Chase Field
1         735        Atlanta Braves                 Turner Field
2         741     Baltimore Orioles  Oriole Park at Camden Yards
3         872        Boston Red Sox               Fenway Park II
4         724     Chicago White Sox          U.S. Cellular Field

In [30]:
runs_per_team09_new.shape

(30, 3)

## Don't worry about speed until it matters!

* I don't emphasize speed most of the time.
* In this case, either approach was nearly instant.
* Still ... `join`s are *so dangerous* that I make an exception here!

## <font color="red"> Exercise 1 </font>

Determine all the players that have hit more than 50 home runs in a season.  The final table should include the players proper name, as well as the team name.  

**Hint:** You will need join the files listed below.  To get credit for this exercise, use the join methods presented above.

In [8]:
files = ("./data/baseball/core/Batting.csv", 
         "./data/baseball/core/People.csv",
         "./data/baseball/core/Teams.csv")

In [9]:

batting = pd.read_csv(files[0])
batting.head(2)

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,abercda01,1871,1,TRO,NaN,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,0.0
1,addybo01,1871,1,RC1,NaN,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,0.0

In [10]:
batting.columns

Index(['playerID', 'yearID', 'stint', 'teamID', 'lgID', 'G', 'AB', 'R', 'H',
       '2B', '3B', 'HR', 'RBI', 'SB', 'CS', 'BB', 'SO', 'IBB', 'HBP', 'SH',
       'SF', 'GIDP'],
      dtype='object')

In [11]:
people = pd.read_csv(files[1])
people.head(2)

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,215.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01

In [12]:
people.columns

Index(['playerID', 'birthYear', 'birthMonth', 'birthDay', 'birthCountry',
       'birthState', 'birthCity', 'deathYear', 'deathMonth', 'deathDay',
       'deathCountry', 'deathState', 'deathCity', 'nameFirst', 'nameLast',
       'nameGiven', 'weight', 'height', 'bats', 'throws', 'debut', 'finalGame',
       'retroID', 'bbrefID'],
      dtype='object')

In [13]:
teams = pd.read_csv(files[2])
teams.head(2)

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
0,1871,NaN,BS1,BNA,NaN,3,31,NaN,20,10,...,24,0.834,Boston Red Stockings,South End Grounds I,NaN,103,98,BOS,BS1,BS1
1,1871,NaN,CH1,CNA,NaN,2,28,NaN,19,9,...,16,0.829,Chicago White Stockings,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1

In [14]:
teams.columns

Index(['yearID', 'lgID', 'teamID', 'franchID', 'divID', 'Rank', 'G', 'Ghome',
       'W', 'L', 'DivWin', 'WCWin', 'LgWin', 'WSWin', 'R', 'AB', 'H', '2B',
       '3B', 'HR', 'BB', 'SO', 'SB', 'CS', 'HBP', 'SF', 'RA', 'ER', 'ERA',
       'CG', 'SHO', 'SV', 'IPouts', 'HA', 'HRA', 'BBA', 'SOA', 'E', 'DP', 'FP',
       'name', 'park', 'attendance', 'BPF', 'PPF', 'teamIDBR',
       'teamIDlahman45', 'teamIDretro'],
      dtype='object')

In [15]:
batting_select = (batting
                  >> select(X.playerID,
                            X.yearID,
                            X.teamID,
                            X.HR)
                 )
batting_select.head()

    playerID  yearID teamID  HR
0  abercda01    1871    TRO   0
1   addybo01    1871    RC1   0
2  allisar01    1871    CL1   0
3  allisdo01    1871    WS3   2
4  ansonca01    1871    RC1   0

In [16]:
batting_select.shape

(104324, 4)

In [17]:
people_select = (people
                  >> select(X.playerID,
                            X.nameGiven)
                 )
people_select.head()

    playerID       nameGiven
0  aardsda01     David Allan
1  aaronha01     Henry Louis
2  aaronto01      Tommie Lee
3   aasedo01  Donald William
4   abadan01   Fausto Andres

In [18]:
teams_select = (teams
                  >> select(X.yearID,
                            X.teamID,
                            X.name)
                 )
teams_select.head()

   yearID teamID                     name
0    1871    BS1     Boston Red Stockings
1    1871    CH1  Chicago White Stockings
2    1871    CL1   Cleveland Forest Citys
3    1871    FW1     Fort Wayne Kekiongas
4    1871    NY2         New York Mutuals

In [19]:
df_joined = batting_select >> left_join(people_select, by='playerID')
df_joined.head()

    playerID  yearID teamID  HR           nameGiven
0  abercda01    1871    TRO   0   Francis Patterson
1   addybo01    1871    RC1   0       Robert Edward
2  allisar01    1871    CL1   0     Arthur Algernon
3  allisdo01    1871    WS3   2          Douglas L.
4  ansonca01    1871    RC1   0  Adrian Constantine

In [20]:
df_joined2 = df_joined >> left_join(teams_select, by=['yearID', 'teamID'])
df_joined2.head()

    playerID  yearID teamID  HR           nameGiven                    name
0  abercda01    1871    TRO   0   Francis Patterson          Troy Haymakers
1   addybo01    1871    RC1   0       Robert Edward   Rockford Forest Citys
2  allisar01    1871    CL1   0     Arthur Algernon  Cleveland Forest Citys
3  allisdo01    1871    WS3   2          Douglas L.     Washington Olympics
4  ansonca01    1871    RC1   0  Adrian Constantine   Rockford Forest Citys

In [23]:
hrfiltered = (df_joined2
                   >> select(X.playerID, X.yearID, X.teamID, X.HR, X.nameGiven, X.name)
                   >> filter_by(X.HR > 50)
                   )
hrfiltered

,playerID,yearID,teamID,HR,nameGiven,name
18532,ruthba01,1920,NYA,54,George Herman,New York Yankees
19052,ruthba01,1921,NYA,59,George Herman,New York Yankees
22269,ruthba01,1927,NYA,60,George Herman,New York Yankees
22799,ruthba01,1928,NYA,54,George Herman,New York Yankees
23978,wilsoha01,1930,CHN,56,Lewis Robert,Chicago Cubs
24652,foxxji01,1932,PHA,58,James Emory,Philadelphia Athletics
27765,greenha01,1938,DET,58,Henry Benjamin,Detroit Tigers
33000,kinerra01,1947,PIT,51,Ralph McPherran,Pittsburgh Pirates
33102,mizejo01,1947,NY1,51,John Robert,New York Giants
34152,kinerra01,1949,PIT,54,Ralph McPherran,Pittsburgh Pirates
37832,mayswi01,1955,NY1,51,Willie Howard,New York Giants
38465,mantlmi01,1956,NYA,52,Mickey Charles,New York Yankees
41672,mantlmi01,1961,NYA,54,Mickey Charles,New York Yankees
41674,marisro01,1961,NYA,61,Roger Eugene,New York Yankees
44655,mayswi01,1965,SFN,52,Willie Howard,San Francisco Giants
54760,fostege01,1977,CIN,52,George Arthur,Cincinnati Reds
67721,fieldce01,1990,DET,51,Cecil Grant,Detroit Tigers
74877,mcgwima01,1996,OAK,52,Mark David,Oakland Athletics
75833,griffke02,1997,SEA,56,George Kenneth,Seattle Mariners
77077,griffke02,1998,SEA,56,George Kenneth,Seattle Mariners
77403,mcgwima01,1998,SLN,70,Mark David,St. Louis Cardinals
77750,sosasa01,1998,CHN,66,Samuel Peralta,Chicago Cubs
78719,mcgwima01,1999,SLN,65,Mark David,St. Louis Cardinals
79067,sosasa01,1999,CHN,63,Samuel Peralta,Chicago Cubs
80766,bondsba01,2001,SFN,73,Barry Lamar,San Francisco Giants
81093,gonzalu01,2001,ARI,57,Luis Emilio,Arizona Diamondbacks
81687,rodrial01,2001,TEX,52,Alexander Enmanuel,Texas Rangers
81784,sosasa01,2001,CHN,64,Samuel Peralta,Chicago Cubs
83010,rodrial01,2002,TEX,57,Alexander Enmanuel,Texas Rangers
83165,thomeji01,2002,CLE,52,James Howard,Cleveland Indians
86621,jonesan01,2005,ATL,51,Andruw Rudolf,Atlanta Braves
87901,howarry01,2006,PHI,58,Ryan James,Philadelphia Phillies
88245,ortizda01,2006,BOS,54,David Americo,Boston Red Sox
89782,rodrial01,2007,NYA,54,Alexander Enmanuel,New York Yankees
92929,bautijo02,2010,TOR,54,Jose Antonio,Toronto Blue Jays
97326,davisch02,2013,BAL,53,Christopher Lyn,Baltimore Orioles
103524,judgeaa01,2017,NYA,52,Aaron James,New York Yankees
104122,stantmi03,2017,MIA,59,Giancarlo Cruz-Michael,Miami Marlins

## Up Next

Stuff